#!/usr/bin/env python
# -*- coding:utf-8 -*-
# coding by xiaoming
   # ：首字母大写

   # ：将每个单词首字母变为大写

   # ：将所有字母变为大写

   # ：将所有字母变为小写

   # ：大小写互换

   # ：计算字符串的长度

   # ：计算指定字符串出现的次数

   # ：查找指定字符串第一次出现的位置

   # ：查找指定字符串第一次出现的位置

   # ：检测字符串是否以指定的字符串开头

   # ：检测字符串是否以指定的字符串结尾

   # ：检测一个字符串中的英文是否都是大写字母，符号不算

   # ：检测一个字符串中的英文是否都是小写字母，符号不算

   # ：检测字符串是否由数字，字母和文字等组成

   # ：检测字符串是否有字母和文字组成

   # ：检测字符串是否由纯数字组成  十进制

   # ：检测字符串是否是数值字符串  数字整数

   # ：检测字符串是否是纯数值字符串组成

   # ：检测字符串是否由空白字符组成

   # ：检测字符串是否符合title()的结果

   # ：将字符串按照指定字符进行切割操作

   # ：将字符串按照换行位置进行切割操作

   # ：将列表中的内容按照指定字符连接成一个字符串

   # ：在原有字符串长度不足指定长度时，用0填充

   # ：指定字符串长度，并且使得元字符串内容居中，其余位置使用指定字符填充

   # ：指定字符串长度，并且使得元字符串内容靠左，其余位置使用指定字符填充

   # ：指定字符串长度，并且使得元字符串内

   # ：去掉左右2侧的指定字符，默认空格

   # ：去掉左侧的指定字符，默认空格

   # ：去掉右侧的指定字符，默认空格

   # ：制作用于字符串替换的映射表

   # ：进行字符串替换操作

























































