#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<>

#
# isupper()
# 功能：检测一个字符串中的英文是否都是大写字母，符号不算
# 格式：字符串.isupper()
# 返回值:布尔值
#
#
# islower()
# 功能：检测一个字符串中的英文是否都是小写字母，符号不算
# 格式：字符串.islower()
# 返回值：布尔值
#
#
# isalnum()
# 功能：检测字符串是否由数字，字母和文字等组成
# 格式：字符串.isalnum()
# 返回值：布尔值  汉字当作普通字符处理，没有标点和特殊字符就是真，空字符串为false
# isalpha()
# 功能：检测字符串是否有字母和文字组成
# 格式：字符串.isalpha()
# 返回值：布尔值，汉字当作普通字母处理。空字符串为false
# isdigit()
# 功能：检测字符串是否由纯数字组成  十进制
# 格式：字符串.isdigit()
# 返回值：布尔值
# isnumeric()
# 功能：检测字符串是否是数值字符串  数字整数
# 格式:字符串.isnumeric()
# 返回值：布尔值
# isdecimal()
# 功能：检测字符串是否是纯数值字符串组成
# 格式:字符串.isdecimal()
# 返回值：布尔值
# isspace()
# 功能：检测字符串是否由空白字符组成
# 格式:字符串.isspace()
# 返回值：布尔值
#
#
# istitle()
# 功能：检测字符串是否符合title()的结果
# 格式：字符串.istitle()
# 返回值:布尔值















'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
