#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<>
#
# split()
# 功能：将字符串按照指定字符进行切割操作
# 格式：字符串.split(切割指定字符串)
# 返回值：列表
#
#
# splitlines()
# 功能：将字符串按照换行位置进行切割操作
# 格式：字符串.splitlines([结束符号])
# 返回值：列表
#
#
# join()
# 功能：将列表中的内容按照指定字符连接成一个字符串
# 格式:连接字符串.join(列表)
# 返回值：字符串
#
#
# zfill()
# 功能：在原有字符串长度不足指定长度时，用0填充
# 格式:字符串.zfill(指定长度)
# 返回值：字符串   不足的长度使用0填满，原来的字符串内容靠右
#
#
# center()
# 功能：指定字符串长度，并且使得元字符串内容居中，其余位置使用指定字符填充
# 格式: 字符串.center(指定长度[，填充字符])
# 返回值：字符串  填充字符默认空格，可以指定其他
#
#
# ljust()
# 功能：指定字符串长度，并且使得元字符串内容靠左，其余位置使用指定字符填充
# 格式：字符串.ljust(指定长度[，填充字符])
# 返回值：字符串  填充字符默认空格，可以指定其他
# rjust()
# 功能：指定字符串长度，并且使得元字符串内容靠右，其余位置使用指定字符填充
# 格式：字符串.rjust(指定长度[，填充字符])
# 返回值：字符串  填充字符默认空格，可以指定其他
# strip()
# 功能：去掉左右2侧的指定字符，默认空格
# 格式:字符串.strip([指定字符])
# 返回值：字符串
# lstrip()
# 功能：去掉左侧的指定字符，默认空格
# 格式:字符串.lstrip([指定字符])
# 返回值：字符串
# rstrip()
# 功能：去掉右侧的指定字符，默认空格
# 格式:字符串.rstrip([指定字符])
# 返回值：字符串
# maketrans() 和 translate()
# maketrans()
#     功能：制作用于字符串替换的映射表
#     格式: 字符串.maketrans('查找字符','替换字符')    两个字符必须长度相等
#     返回值：字典
#
# translate()
#     功能：进行字符串替换操作
#     格式：字符串.translate(映射表)
#     返回值：替换之后的字符串















'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
