#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<>

# 字符串函数
# capitalize()
# 功能：首字母大写
# 格式：字符串.capitalize()
# 返回值：新字符串
#
#
# title()
# 功能：将每个单词首字母变为大写
# 格式：字符串.title()
# 返回值：新字符串
#
#
# upper()
# 功能：将所有字母变为大写
# 格式：字符串.upper()
# 返回值：新字符串
#
#
# lower()
# 功能：将所有字母变为小写
# 格式：字符串.lower()
# 返回值：新字符串
#
#
# swapcase()
# 功能：大小写互换
# 格式：字符串.swapcase()
# 返回值:新字符串
#
#
# len()
# 功能：计算字符串的长度
# 格式:len(字符串)
# 返回值：整型
#
#
# count()
# 功能：计算指定字符串出现的次数
# 格式：字符串.count(查找字符串[,开始索引[,结束索引]])
# 返回值：整数
#
#
# find()
# 功能：查找指定字符串第一次出现的位置
# 格式：字符串.find(查找字符串[,开始索引[,结束索引]])
# 返回值：整数   找不到返回-1
#
#
# index()
# 功能：查找指定字符串第一次出现的位置
# 格式：字符串.index(查找字符串[,开始索引[,结束索引]])
# 返回值：整数   找不到抛出错误！
#
#
# 注意： find 和 index 的区别在于，当指定字符查找不到时，find返回-1，程序可以继续执行，而index则报错，程序无法继续执行。
#
# startswith()
# 功能：检测字符串是否以指定的字符串开头
# 格式：字符串.startswith(查找字符串)
# 返回值：布尔值
#
#
# endswith()
# 功能：检测字符串是否以指定的字符串结尾
# 格式：字符串.endswith(查找字符串)
# 返回值：布尔值



'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
