#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<>

'''


要求:
*********************************************
欢迎使用[名片管理系统]v1.9

1.新建一个名片
2.显示全部名片
3.查询对应名片
    修改操作:
        要是不改,就是原来的那个
    删除操作
4.退出名片系统
*********************************************

    姓名 电话 邮箱



目标:
    变量
    流程控制

    框架搭钩
    函数开发
'''


wel = '''
*******************************
欢迎使用[名片管理系统]v1.9

    1.新建一个名片
    2.显示全部名片
    3.查询对应名片
    4.退出名片系统

*******************************

'''

print(wel)










'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
