#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<Python的介绍, python的注释和变量名>

'''
python是全球第四大流行的语言之一
云计算\大数据分析\人工智能\自动化运维\web开发\游戏开发\爬虫\金融分析

python 有以下几个优点:

    1. 简单
    2. 易学
    3. 开发速度快
    4. 免费 开源
    5. 高级语言
    6. 跨平台性
        unix Linux Windows
    7. 可扩展性
        各种包,库,框架
    8. 胶水语言
        可以和各大语言融合Cpython\Jpython
'''
print("后宫佳丽三千人,铁杵磨成绣花针")

# 我当时的思路就是 饿了

'''
    多行注释  2W5个字
'''
"""
    程序员请注意,这个客户SB

"""
# 变量    为啥要学习变量  c 变量
# 强类型语言   -----   弱类型语言    猪脑算

# 英文开头  数字 _

a_1 = 10

print(a_1)

# = 后面都可以跟着哪些大哥     数据类型    数字    number
a = 10  # 整数
a = 10.1  # 小数    浮点

# 布尔类型   True  真   False  假   判断
a = True
print(a)

# 啥是字符串啊?    字符??     ''    ""
a = "小母牛迎风劈叉----吹牛逼"
print(a)

a = 'True'
print(20)

a = '''小母牛掉酒钢

-----醉牛

逼'''
print(a)

'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
