#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<>

'''
爬虫:一种模拟浏览器发送请求,获取信息
通用爬虫
    # 今日头条
    # 百度
    #     爬各种连接
# 聚焦爬虫
#     程序员根据企业需求有目的性的写出爬虫程序,其功能具有一定的针对性
#
# 大数据时代的数据来源:
#     1.大型企业自身获得用户数据,腾讯\阿里\百度\网易
#     2.数据采集企业,线下市场人员进行市场调研,问卷调查
#     3.政府机构进行的数据统计,地方政府统计上报给中央政府,统一整合(人口,GDP)
#     4.网站贩卖的数据
#     5.以上数据都无法满足需求,或价格昂贵,程序员去开发一个爬虫程序

浏览器:谷歌 火狐 ->>>开发者工具

'''

'''weekend:
    大数据时代的数据来源：
    1.	大型企业生产的数据
    2.	数据管理咨询公司
    3.	政府部门提供的公开数据
    4.	第三方数据平台购买
    5.	爬虫采集:市场上没有我们需要的数据，或者价格太高，招收爬虫工程师，从网站上爬取数据
    什么是爬虫
    抓取数据的程序（html，json）
    分析哪些语言能做爬虫
    1.	python：代码优美，语法简介，开发效率极高，开源模块众多，不重复造轮子，http请求和HTML解析模块丰富，拥有强大的框架（scrapy/pyspider），非常容易实现爬虫（scrapy-redis）
    2.	PHP：out
    3.	c/c++：根本不是圈里人，基本没有公司招工程师做爬虫
    4.	java：很成熟，有完善的生态圈，python爬虫的最大对手。Java的语言很笨重，代码量大，导致维护成本高，针对爬虫需要反复的维护
    主要关注
    1.	发送请求模块
    2.	解析模块
    
    反反爬虫 
    其实爬虫最头疼的不是页面，也不是数据，最烦人的就是对方的反爬虫
    #文档这玩意，
    User-agent历史
    IE vs Netscape
    IE胜出从此没有了网景
    
    开发者，你不用谷歌和火狐浏览器， 那太low了

'''













'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
