路飞学城
花点时间介绍python:

    1. python为什么这么火
    2. python的发展趋势
    3. python的应用领域

python的语言排名
与其他语言的区别
python的生态圈
python的就业前景
未来10年的python的发展分析
课程内容介绍

自我介绍:
    Alex 金角大王
    路飞雪城的讲师,老男孩教育的创始人,python的讲师
    10年IT行业技术经验
    国内知名的python的传播者
    汽车之家
    路飞学城
    喜欢姑娘
    爱好电影
    读书
    旅行

了解一门语言,你再京东上买个东西,得看看排名吧

全球TIOBE编程语言排名
    权威的:
    世界上有600多种编程语言,真正的不超过20个,如果他没有进入前20,那几乎没有用了

    python现在拍第4
历史排名会反映他的发展趋势,python的发展就想一个小男孩儿,穷光蛋,慢慢就富起来了
    未来会不会火???

python和其他语言有什么区别???
    对比java:
    目前使用最为广泛的编程语言,第一个跨平台语言,在大型ERP软件开发\安卓APP开发\网站开发领域使用广泛
        java是跨平台的语言
        eg:
            安卓是用java开发的 而 苹果是用object-C开发的
        如果你要开发一个APP,那你得请一个安卓开发工程师,和一个苹果开发工程师,开发成本高不高???

        那我现在想要一个开发都能用的
        java就是这样能跨平台的,但是不是手机上,而是在操作系统上

    C/C++ :
        编程语言的始祖级别的,自从人类编程,就是C/C++:

            C指针和堆栈之间的关系,你还没搞明白 那还比较low,他还比较底层,你想实现什么工能
            开发效率低
        在游戏/什么用性能比较多的,用C语言,比较多
        那你如果想入手,不要学C和C++
    PHP :
        PHP是世界上最好的语言,现在有点儿往下走的趋势了

    python :
        java能干的python几乎他都能干,除了安卓开发这个
        自动化测试,自动化运维
        java像稳重成熟的中年人
        python像血气方刚的青年

python生态圈:
    python在人工智能,金融分析
(python擅长的方面):
    web开发,java\PHP nononon  python的第一个web框架,贼牛逼
    人工智能 分析 引力波事件(python写的程序),()
    Google 2014年,人工智能的拐点 一个华人科学家 吴恩达 :让程序自己学习 搜索猫的照片
程序找到了许多相似的照片
    云计算:\
        python写的open框架
    金融量化分析:
        金融分析程序
    爬虫:
        爬虫几乎就不用别的
    自动化运维:
        python在自动化运维,最好的
    科学运算:
        王者荣耀,不是python写的

python生态圈比较全的,应用前景\就业前景
PHP应用过于单一,只能做web开发

知名的使用python公司
    Google\阿尔法狗
    Dropbox(美国版的百度网盘)
    YouTube 国内外最大的视频网站