#!/usr/bin/env python
# -*- coding:utf-8 -*-
# coding by xiaoming
'''
字符串操作
+  字符串连接操作
*  字符串复制操作
[] 字符串索引操作，通过索引访问指定位置的字符，索引从0开始
[::] 字符串取片操作
    完整格式：[开始索引:结束索引:间隔值]
    [:结束索引]  从开头截取到结束索引之前
    [开始索引:]  从开始索引截取到字符串的最后
    [开始索引：结束索引]  从开始索引截取到结束索引之前
    [:]  截取所有字符串
    [开始索引:结束索引:间隔值]  从开始索引截取到结束索引之前按照指定的间隔截取字符
r'字符串'   元字符串，所有字符串中的转义字符不会转义，当作普通字符

'''
# 如何声明一个字符串
'''
三种方式:
    1. 单引号声明
    2. 双引号声明
    3. 三引号声明:
        三单
        三双

+ 字符串拼接操作
* 字符串复制
[]字符串查找操作
[::]字符串切片操作
'''
#
# str1 = "是兄弟就来砍我"
# str2 = "我是渣渣辉"
# # 字符串拼接
# result = str1 + str2
# print(result)
# # 数值相加
# var1 = 10
# var2 = 20
# result12 = var1 + var2
# print(result12)
#
# # 字符串能不能和数值类型相加
# str1 = "啪啪啪键盘摩擦,全身火花"
# a = str1 + var2
# print(a)
#

# # 字符串的复制操作
# str1 = "鹅鹅鹅,曲项向天歌,白毛浮绿水,红掌拨清波"
#
# result = str1 * 3
# print(result)

# 字符串的查找操作
# 索引   0 1 23 4 567 89 101112

'''
str1 = "将进酒,杯莫停,举杯歌一曲"
result = str1[5]
print(result)

# 字符串切片操作
完整格式：
    str1【开始值:结束值，【间隔值 = 1】】
'''
#
# str1 = "抽刀断水水更流,举杯消愁愁更愁"
# result = str1[3:5]
# print(result)

# 没有结束值的切片操作

# str1 = "抽刀断水水更流,举杯消愁愁更愁"
# result = str1[8:]
# print(result)
#
# # 带有间隔值的索引
#
# str1 = "抽刀断水水更流,举杯消愁愁更愁"
# result = str1[2:10:3]
# print(result)


# str1 = "鹅鹅鹅,曲项向天歌,白毛浮绿水,红掌拨清波"
# #
# print(str1)
# result  = str1[3:9:2]
# print(result)

str1 = "python,php,java,html,css,javastript"
print(str1)
result = str1[4:16:4]
print(result)

str2 = r"\t\\\\c.\r\t\n"
print(str2)
#
# 切片格式:
#     [起始值:结束值:间隔值 = 1]




