#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by xiaoming

# 本模块的功能:<# 运算与运算符# Python的运算和运算符 , +-*/ 等操作>

'''
运算和运算符
运算： 由一个以上的值经过变化得到新值得过程，就是运算。

运算符： 用于运算的符号，就是运算符

运算的分类：

1.算数运算
2.比较运算/关系运算
3.赋值运算
4.逻辑运算
5.位运算
6.成员运算
7.身份运算
算术运算

+   加法运算
-   减法运算
*   乘法运算
/   除法运算
%   取余运算
//  取商运算   地板除
**  幂运算
关系运算/比较运算
<    小于运算
>    大于运算
==   等于运算
<=   小于等于运算
>=   大于等于运算
!=   不等于运算
赋值运算
=     普通赋值运算
+=    加法赋值运算
-=    减法赋值运算
*=    乘法赋值运算
/=    除法赋值运算
%=    取余赋值运算
//=   取商赋值运算
**=   幂赋值运算
所有运算赋值操作的格式都可以转换为[变量 = 变量 运算符 值],如：

var /= 5   相当于   var = var / 5
逻辑运算
逻辑运算就是布尔值之间的运算，Python只有三种运算方式

1.and 逻辑与运算(有假则假；两边为真才是真)

洗手：
    左手洗了True，右手洗了True，洗完了 True
    左手洗了True，右手没洗False，没洗完 False
    左手没洗False，右手洗了True，没洗完 False
    左手没洗False，右手没洗False，没洗完 False
2.or 逻辑或运算(有真则真；两边为假才是假)

钥匙丢了找钥匙：
    你没找到钥匙False，你媳妇也没有找到钥匙False，钥匙没找到 False
    你找到了钥匙True，你媳妇没找到钥匙False，钥匙找到了 True
    你没有找到钥匙False，你媳妇找到了钥匙True，钥匙找到了 True
    你和你媳妇同时找到了钥匙True和True，钥匙找到了 True
3.not 逻辑非运算(真变假，假变真)

老爷们去了泰国
    纯爷们儿True，做了手术，不是纯爷们儿了 False

'''















'''
当你的才华还撑不起你的野心时,那你就应该静下心来学习
当你的能力还驾驭不了你的目标时,那就应该沉下心来历练
'''
