#这个是就是文艺(装逼)青年版

menu = {
	'北京':{
		'海淀':{...},
		'昌平':{
			'沙河':{
				'老男孩':{...},
				'贼溜啊':{...},	
			},
			'天通苑':{
			'这样':{
			'那样的':{...},
			'啥样的':{
				'王':{
					'李':{...},
				}
			},
			
			},
			},
			'回龙观':{
			
			},
		},
		'朝阳':{...},
		'东城':{...},
	},
	'上海':{
		'闽行':{...},
		'闸北':{...},
		'浦东':{...},
	},
	'山东':{
		'济南':{
			
			'景点':{},
			'美食':{},
			'商场':{},
			'银行':{},
			'医院':{},
			'电影院':{},
			'KTV':{},
			'酒店':{},
			'加油站':{},
		},
		'青岛':{
		
			'景点':{},
			'美食':{},
			'商场':{},
			'银行':{},
			'医院':{},
			'电影院':{},
			'KTV':{},
			'酒店':{},
			'加油站':{},
		},
		'淄博':{...},
		'枣庄':{...},
		'东营':{...},
		'烟台':{
		
			'景点':{},
			'美食':{},
			'商场':{},
			'银行':{},
			'医院':{},
			'电影院':{},
			'KTV':{},
			'酒店':{},
			'加油站':{},
		},
		'潍坊':{...},
		'济宁':{...},
		'潍坊':{...},
		'泰安':{...},
		'威海':{...},
		'日照':{...},
		'莱芜':{...},
	},
}

current_layer = menu
while True:
	for k in current_layer:
		print(k)
	choice = input(">:").strip()
	if not choice:continue
	
	if  choice in current_layer:
		current_layer = current_layer[choice]		#[北京]
# 这个时候我的程序就写完了,充分简化了重复的代码
# 让我们来测试一下
